MLDCRe3_OF2106/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "boxDimensions"

transportModel  Newtonian;

nu              [0 2 -1 0 0 0 0] 1.0;

boxSide         [0 1 0 0 0 0 0] $side;

boxVel          [0 1 -1 0 0 0 0] 3.0;


// ************************************************************************* //
